import {
  LifePassportKey,
  LifePassportTable,
} from 'src/app/models/life-passport';

export const LIFE_PASSPORT_TABLE: LifePassportTable = {
  0: {
    [LifePassportKey.方形三角圓圈]: '',
    [LifePassportKey.方形三角]: '',
    [LifePassportKey.方形圓圈]: '',
    [LifePassportKey.方形]: '',
    [LifePassportKey.三角]:
      '你的一生有很多的可能性，可以多方嘗試說不定有意想不到的驚喜，也代表接收外界的訊息，通常第6感也比較強。但也代表固執和勞碌命特質，會比別人來的辛苦一點，要比別人更加的努力才會有回收。',
    [LifePassportKey.圓圈多]:
      '你的一生有很多的可能性，可以多方嘗試說不定有意想不到的驚喜，也代表接收外界的訊息，通常第6感也比較強。但是有可能機會來的太多也會造成勞碌命，有很多事情要忙，或者活動力太旺盛、無法專注的情形，要努力幫助自己開發其他特質，學習去嘗試去接收各種不同的人事物，讓活動力旺盛發揮在對的地方。',
    [LifePassportKey.圓圈少]:
      '你的一生有很多的可能性，可以多方嘗試說不定有意想不到的驚喜，也代表接收外界的訊息，通常第6感也比較強。',
    [LifePassportKey.圓圈]: '',
    [LifePassportKey.無數字]:
      '比較容易有後知後覺和勞碌命特質，容易有白手起家的命格。',
  },
  1: {
    [LifePassportKey.圓圈]: '',
    [LifePassportKey.圓圈少]:
      '你是走在前端有領導力，獨立，有能力靠自己的力量去解決事情，勇於表達自己，不喜歡拐彎抹角',
    [LifePassportKey.圓圈多]:
      '你是獨立、有領導力和勇於表現自己。你有解決問題的能力，喜直言不議，不喜歡拐彎抹角。但過於堅持自己的觀點和自主意識過強可能會出現一些問題。建議多聽別人的想法，虛心接受別人的意思，這樣對你更好',
    [LifePassportKey.三角]:
      '你是獨立、有領導力和勇於表達自己，不喜歡拐彎抹角。但有時你可能會過於追求表現和勝利，或者不願意承擔責任。你的自我意識和自尊心很強，容易在乎輸贏。儘管你是一個有能力的人，但容易固執和堅持己見。容易出現自我偽裝，想得到他人的認同，這樣的想法可能會讓你身心俱疲。建議你傾聽他人的意見，這樣可能會帶來意想不到的效果',
    [LifePassportKey.方形三角圓圈]:
      '你是走在前端有領導力，獨立，有能力靠自己的力量去解決事情，勇於表達自己，不喜歡拐彎抹角，但是可能會出現太愛表現、太好勝的情況出現，不然就是出現不願意承擔的情況，領導才能沒有得到應有的發揮和表現。自我意識比較強，自尊心高，容易在乎輸贏。是很有能力的人但相對也會比較固執，堅持己見，有時候一個特質過多過少都不好。或許可以傾聽他人給你的意見會有意想不到的效果。容易出現自我偽裝，希望別人覺得自己很厲害很強，但有時這樣的偽裝會讓自己身心俱疲。這是你一生的課題，學習接納自己的一切，特別要接受你覺得「不好」的部分，因為自信不用證明給其他人看，最好的自信是接受全面向的自己。也可以試著去對他人敞開心房、依賴別人、少一點強勢的特質',
    [LifePassportKey.方形]:
      '你是走在前端有領導力，獨立，有能力靠自己的力量去解決事情，勇於表達自己。你一生的課題，要學習接納自己的一切，特別要接受你覺得「不好」的部分，因為自信不用證明給其他人看，最好的自信是接受全面向的自己。也可以試著去對他人敞開心房、依賴別人、少一點強勢的特質',
    [LifePassportKey.方形三角]:
      '你的自我意識比較強，自尊心高，容易在乎輸贏，是很有能力的人但相對也會比較固執，堅持己見，有時候一個特質過多過少都不好，或許可以傾聽他人給你的意見會有意想不到的效果。容易出現自我偽裝，希望別人覺得自己很厲害很強，但有時這樣的偽裝會讓自己身心俱疲。這是你一生的課題，學習接納自己的一切，特別要接受你覺得「不好」的部分，因為自信不用證明給其他人看，最好的自信是接受全面向的自己。也可以試著去對他人敞開心房、依賴別人、少一點強勢的特質',
    [LifePassportKey.方形圓圈]:
      '你是走在前端有領導力，獨立，有能力靠自己的力量去解決事情，勇於表達自己，不喜歡拐彎抹角。你一生的課題，要學習接納自己的一切，特別要接受你覺得「不好」的部分，因為自信不用證明給其他人看，最好的自信是接受全面向的自己。也可以試著去對他人敞開心房、依賴別人、少一點強勢的特質',
    [LifePassportKey.無數字]:
      '你缺乏獨立意識，開創性弱，對於創意創新能力不夠強健，比較沒有自己的主見，容易受人影響，定性比較不足，依賴性很強，比起自己更願意依賴他人，這樣的特質會希望能多去體驗多多吸取不同的經驗，才不會容易活在自己的小圈圈裡。',
  },
  2: {
    [LifePassportKey.方形三角圓圈]:
      '你可以很快融入朋友圈、善於與別人相處交心，注重細節，對人很親切溫和，喜歡有同伴的陪伴，喜歡團體生活，依賴性高、也很擅長分析。但有可能是分析過了頭或是分析能力沒有展現，或是人緣好但是比較慢熟型，需要一點時間才會與人熟絡，有時候可能會出現沒有主見、優柔寡斷、容易因為他人的建議受到影響。在桃花感情上，可能會為情所困遇到波折，也可能是和曾經很愛的人因為一些原因最後沒有些成正果。你害怕被孤立獨處、或是要自己做決定，這種沒有依靠的感覺。你也不太喜歡討論衝突性的議題或是需要選邊站的情況。可以試著學會獨立、學會耐心與培養同情心、積極主動的態度，對你更好。',
    [LifePassportKey.方形三角]:
      '可能是人緣好但是比較慢熟型，需要一點時間才會與人熟絡，有時候可能會出現沒有主見、優柔寡斷、容易因為他人的建議受到影響。很擅長分析，但可能出現分析過了頭或是分析能力沒有展現。在桃花感情上，可能會為情所困遇到波折，也可能是和曾經很愛的人因為一些原因最後沒有些成正果。這是你一生的課題，你害怕被孤立獨處、或是要自己做決定，這種沒有依靠的感覺。你也不太喜歡討論衝突性的議題或是需要選邊站的情況。可以試著學會獨立、學會耐心與培養同情心、積極主動的態度，對你更好。',
    [LifePassportKey.方形圓圈]:
      '你可以很快融入朋友圈、善於與別人相處交心，注重細節，對人很親切溫和，很喜歡有同伴的陪伴，喜歡團體生活，依賴性高、也很擅長分析。你一生的課題，你害怕被孤立獨處、或是要自己做決定，這種沒有依靠的感覺。你也不太喜歡討論衝突性的議題或是需要選邊站的情況。可以試著學會獨立、學會耐心與培養同情心、積極主動的態度，對你更好',
    [LifePassportKey.方形]:
      '這是你一生的課題，你害怕被孤立獨處、或是要自己做決定，這種沒有依靠的感覺。你也不太喜歡討論衝突性的議題或是需要選邊站的情況。可以試著學會獨立、學會耐心與培養同情心、積極主動的態度，對你更好。',
    [LifePassportKey.三角]:
      '你可以很快融入朋友圈、善於與別人相處交心，注重細節，對人很親切溫和，很喜歡有同伴的陪伴，喜歡團體生活，依賴性高、也很擅長分析。但有可能是分析過了頭或是分析能力沒有展現，或是人緣好但是比較慢熟型，需要一點時間才會與人熟絡，有時候可能會出現沒有主見、優柔寡斷、容易因為他人的建議受到影響，不能忍耐孤獨。在桃花感情上，可能會為情所困遇到波折，也可能是和曾經很愛的人因為一些原因最後沒有些成正果。',
    [LifePassportKey.圓圈多]: '',
    [LifePassportKey.圓圈少]: '',
    [LifePassportKey.圓圈]:
      '你可以很快融入朋友圈、善於與別人相處交心，注重細節，對人很親切溫和，很喜歡有同伴的陪伴，喜歡團體生活，依賴性高、也很擅長分析。',
    [LifePassportKey.無數字]:
      '你會比別人來的獨立、堅強，不太喜歡依靠別人，不容易與人快速親近，覺得自己來就可以了，雖然獨立是很重要的事情，可是有時候如果能找到一位信任的人試著依賴一下他，你的心情上會比較放鬆不會那麼緊繃，也可以多多微笑、試著表達自己的想法與別人相處或許在姻緣、家人或是人際關係這塊會比較隱藏一些，希望幫你把這部分的特質更加加強。',
  },
  3: {
    [LifePassportKey.方形三角圓圈]:
      '可能是說話比較直、心直口快、說話鋒利，有時候少根筋，很有正義感，會比較容易得罪到別人自己不知道，或是拙於表達。可以多與別人溝通，說話想清楚再開口、也能避免說錯話或是互相踩到地雷的情形。這樣特質的人也建議可以養成多說好話的好習慣，遇到煩惱或者不如意時口說好話，這樣的善意和正能量也會幫助你改變，把天生擁有的特質改變往正向的方向前進。這是你一生的課題的，你會有執著的一面，內心也會有一定的理想主義，會建議試著接受世上沒有完美無缺的人事物，在生活上也會比較輕鬆愉快一些。',
    [LifePassportKey.方形三角]:
      '容易得罪到別人自己不知道，或是拙於表達 。可以多與別人溝通，說話想清楚再開口、也能避免說錯話或是互相踩到地雷的情形。這樣特質的人也建議可以養成多說好話的好習慣，遇到煩惱或者不如意時口說好話，這樣的善意和正能量也會幫助你改變，把天生擁有的特質改變往正向的方向前進。這是你一生的課題的，你會有執著的一面，內心也會有一定的理想主義，會建議試著接受世上沒有完美無缺的人事物，在生活上也會比較輕鬆愉快一些。',
    [LifePassportKey.方形圓圈]:
      '善於表達自己，喜歡把歡樂帶給別人，也可能是嘴甜型或很有說服力的特質，很得人緣，很喜歡創新創意，求新求變的人。你一生的課題的，你會有執著的一面，內心也會有一定的理想主義，會建議試著接受世上沒有完美無缺的人事物，在生活上也會比較輕鬆愉快一些。',
    [LifePassportKey.方形]:
      '也是你一生的課題的，你會有執著的一面，內心也會有一定的理想主義，會建議試著接受世上沒有完美無缺的人事物，在生活上也會比較輕鬆愉快一些。',
    [LifePassportKey.三角]:
      '可能是說話比較直、心直口快、說話鋒利，有時候少根筋，很有正義感，會比較容易得罪到別人自己不知道，或是拙於表達。可以多與別人溝通，說話想清楚再開口、也能避免說錯話或是互相踩到地雷的情形。這樣特質的人也建議可以養成多說好話的好習慣，遇到煩惱或者不如意時口說好話，這樣的善意和正能量也會幫助你改變，把天生擁有的特質改變往正向的方向前進。',
    [LifePassportKey.圓圈多]: '',
    [LifePassportKey.圓圈少]: '',
    [LifePassportKey.圓圈]:
      '善於表達自己，喜歡把歡樂帶給別人，也可能是嘴甜型或很有說服力的特質，很得人緣，很喜歡創新創意，求新求變的人。',
    [LifePassportKey.無數字]:
      '你可能是比較耿直的人或者也是比較愛說話但會不經意說錯話造成誤會，不過沒有說的內容大多都是真心的真話，只是沒有經過修飾。',
  },
  4: {
    [LifePassportKey.方形三角圓圈]:
      '你是責任感重、對事情按部就班不喜歡亂七八糟，對事情自我要求比較高，很多細節希望做到更好，會比較小龜毛型。不過小龜毛也代表你對任何事情都是非常看重和認真，所以我覺得這個部分不見得不好，剛剛好就好。有可能會有安全意識強烈的情況，不敢冒險，怕壓力、怕風險，不喜歡改變的情況，要嘛是責任感過重，不然就是缺乏安全感，或者有可能是龜毛過頭、重程序、完美主義，無法接受別人隨意的言論或行動。你一生的課題，可以用能力來讓自己安心，學習承擔風險，接受改變。有時候觀念和思想上的保守，當你面對到風險較高的事物時，你可能在評估後決定放棄，即使你其實是有能力可以做到的，但在有能力和風險無法管控的不安全的天秤上，你比較容易放棄。',
    [LifePassportKey.方形三角]:
      '你是可能會有安全意識強烈的情況，不敢冒險，怕壓力、怕風險，不喜歡改變的情況，要嘛是責任感過重，不然就是缺乏安全感，或者有可能是龜毛過頭、重程序、完美主義，無法接受別人隨意的言論或行動。你一生的課題，可以用能力來讓自己安心，學習承擔風險，接受改變。有時候觀念和思想上的保守，當你面對到風險較高的事物時，你可能在評估後決定放棄，即使你其實是有能力可以做到的，但在有能力和風險無法管控的不安全的天秤上，你比較容易放棄。',
    [LifePassportKey.方形圓圈]:
      '你是責任感重、對事情按部就班不喜歡亂七八糟，對事情自我要求比較高，規劃能力很好，注重細節，務實警慎，安全感意識很強烈，很多細節希望做到更好，會比較小龜毛、執著的類型。不過小龜毛也代表你對任何事情都是非常看重和認真，所以我覺得這個部分不見得不好，剛剛好就好。你一生的課題，可以能力來讓自己安心，學習承擔風險，接受改變。有時候觀念和思想上的保守，當你面對到風險較高的事物時，你可能在評估後決定放棄，即使你其實是有能力可以做到的，但在有能力和風險無法管控的不安全的天秤上，你比較容易放棄。',
    [LifePassportKey.方形]:
      '你一生的課題，可以能力來讓自己安心，學習承擔風險，接受改變。有時候觀念和思想上的保守，當你面對到風險較高的事物時，你可能在評估後決定放棄，即使你其實是有能力可以做到的，但在有能力和風險無法管控的不安全的天秤上，你比較容易放棄。',
    [LifePassportKey.三角]:
      '你是責任感重、對事情按部就班不喜歡亂七八糟，對事情自我要求比較高，很多細節希望做到更好，會比較小龜毛型。不過小龜毛也代表你對任何事情都是非常看重和認真，所以我覺得這個部分不見得不好，剛剛好就好。有可能會有安全意識強烈的情況，不敢冒險，怕壓力、怕風險，不喜歡改變的情況，要嘛是責任感過重，不然就是缺乏安全感，或者有可能是龜毛過頭、重程序、完美主義，無法接受別人隨意的言論或行動。',
    [LifePassportKey.圓圈多]:
      '你是責任感重、對事情按部就班不喜歡亂七八糟，對事情自我要求比較高，規劃能力很好，注重細節，務實警慎，安全感意識很強烈，很多細節希望做到更好，會比較小龜毛、執著的類型。對錢財會非常敏感，喜歡嗅到錢的感覺。',
    [LifePassportKey.圓圈少]:
      '你是責任感重、對事情按部就班不喜歡亂七八糟，對事情自我要求比較高，規劃能力很好，注重細節，務實警慎，安全感意識很強烈，很多細節希望做到更好，會比較小龜毛、執著的類型。不過小龜毛也代表你對任何事情都是非常看重和認真，所以我覺得這個部分不見得不好，剛剛好就好。',
    [LifePassportKey.圓圈]: '',
    [LifePassportKey.無數字]:
      '容易缺乏安全感、也有可能出現怕黑膽小的特質，對於機會來臨容易產生不積極的態度面對，不願意冒險，容易退縮變化無常。',
  },
  5: {
    [LifePassportKey.方形三角圓圈]:
      '你是一個愛好自由的人，不喜歡受拘束、隨性，行動力持續力強，喜歡四處交朋友，不拘小節，重情重義，注重家庭。有也會出現兩面，一面是自由過頭活動力旺盛靜不下來，一面是自閉一點行動力都沒有，這兩個狀況都有可能會出現。可能也會形成過度自我的情形，對人事物的執著力量很強，例如可能別人跟你說這樣不OK喔可是以你的個性你還是會選擇去嘗試，踢到鐵板再來改變方法，試著去接受別人的經驗和建議，說不定會讓你更好。那你也可能會容易在緊要關頭退縮，要學習承諾、責任與犧牲，能更快實現自己的目標。你一生的課題，要用直球對決的方式面對自己害怕的事情，把這些事情當作一次的冒險，讓自己有機會正式內心恐懼，找到真正的自由。',
    [LifePassportKey.方形三角]:
      '你是愛好自由的人，不喜歡受拘束、隨性，行動力持續力強，可能你會有比較固執的一面，或許別人給你意見但你會希望自己去嘗試去闖蕩，踢到鐵板再回來聽取別人的建議或者改變方法，可以試著去接受別人的經驗和建議，說不定會讓你走許多冤望路。那你也可能會容易在緊要關頭退縮，要學習承諾、責任與犧牲，能更快實現自己的目標。你一生的課題，要用直球對決的方式面對自己害怕的事情，把這些事情當作一次的冒險，讓自己有機會正式內心恐懼，找到真正的自由。',
    [LifePassportKey.方形圓圈]:
      '你是一個愛好自由的人，不喜歡受拘束、隨性，行動力持續力強，喜歡四處交朋友，不拘小節，重情重義，注重家庭。你一生的課題，要用直球對決的方式面對自己害怕的事情，把這些事情當作一次的冒險，讓自己有機會正式內心恐懼，找到真正的自由。',
    [LifePassportKey.方形]:
      '你是一個愛好自由的人，行動力持續力強。你一生的課題，要用直球對決的方式面對自己害怕的事情，把這些事情當作一次的冒險，讓自己有機會正式內心恐懼，找到真正的自由。',
    [LifePassportKey.三角]:
      '你是一個愛好自由的人，不喜歡受拘束、隨性，行動力持續力強。有也會出現兩面，一面是自由過頭活動力旺盛靜不下來，一面是自閉一點行動力都沒有，這兩個狀況都有可能會出現。可能也會形成過度自我的情形，對人事物的執著力量很強，例如可能別人跟你說這樣不OK喔可是以你的個性你還是會選擇去嘗試，踢到鐵板再來改變方法，試著去接受別人的經驗和建議，說不定會讓你更好。',
    [LifePassportKey.圓圈多]: '',
    [LifePassportKey.圓圈少]: '',
    [LifePassportKey.圓圈]:
      '你是一個愛好自由的人，不喜歡受拘束、隨性，行動力持續力強，喜歡四處交朋友，不拘小節，重情重義，注重家庭。這樣的人會蠻適合做業務類型或是需要與人交流的工作，都會有不錯的成績。',
    [LifePassportKey.無數字]:
      '做事容易出現三分鐘熱度或是事情來沒開始就被迫中斷，或者開始了卻只能做一半做白工，成功也會比較困難。',
  },
  6: {
    [LifePassportKey.方形三角圓圈]:
      '你不吝嗇給別人機會，很為家人、朋友奉獻，懂得照顧別人是非常的貼心的人，但也是爛好人特質，不好意思拒絕別人，犧牲自我，雖然喜歡付出但容易付出過頭，未必會得到相等的回報，一心為他人奉獻，但有時自己的問題卻無法好好解決，會告訴這樣的人要多愛自己一點，歡喜做、甘願做心輪才會平衡，心裡會舒服一點。可能會做出付出大過於回報很多的是，盲目付出，無限量供應，讓人予取予求不過也有可能會形成比較自私的特質，但是大部分都會是爛好人特質。這是你一生的課題，這樣的情況會一直跟著你，善良是優點，但就會希望這樣善良的你不要被有心人利用，學會量力而為、適時地說不。',
    [LifePassportKey.方形三角]:
      '你是爛好人特質，不好意思拒絕別人，犧牲自我，雖然喜歡付出但容易付出過頭，未必會得到相等的回報，一心為他人奉獻，但有時自己的問題卻無法好好解決，會告訴這樣的人要多愛自己一點，歡喜做、甘願做心輪才會平衡，心裡會舒服一點。可能會做出付出大過於回報很多的是，盲目付出，無限量供應，讓人予取予求不過也有可能會形成比較自私的特質，但是大部分都會是爛好人特質。這是你一生的課題，這樣的情況會一直跟著你，善良是優點，但就會希望這樣善良的你不要被有心人利用，學會量力而為、適時地說不。',
    [LifePassportKey.方形圓圈]:
      '你不吝嗇給別人機會，很為家人、朋友奉獻，懂得照顧別人是非常的貼心的人，但別人提出的要求和請求會不好意思拒絕別人，會想跟這樣的人說歡喜受甘願做，心輪才會平衡，多多聆聽自己心裡的聲音。這是你一生的課題，這樣的情況會一直跟著你，善良是優點，但就會希望這樣善良的你不要被有心人利用，學會量力而為、適時地說不',
    [LifePassportKey.方形]:
      '你是屬於爛好人特質、別人提出的要求和請求會不好意思拒絕別人很願意犧牲奉獻，但也會想跟這樣的人說歡喜受甘願做，心輪才會平衡，多多聆聽自己心裡的聲音。這是你一生的課題，這樣的情況會一直跟著你，善良是優點，但就會希望這樣善良的你不要被有心人利用，學會量力而為、適時地說不。',
    [LifePassportKey.三角]:
      '你是爛好人特質，不好意思拒絕別人，犧牲自我，雖然喜歡付出但容易付出過頭，未必會得到相等的回報，一心為他人奉獻，但有時自己的問題卻無法好好解決，會告訴這樣的人要多愛自己一點，歡喜做、甘願做心輪才會平衡，心裡會舒服一點。可能會做出付出大過於回報很多的是，盲目付出，無限量供應，讓人予取予求不過也有可能會形成比較自私的特質，但是大部分都會是爛好人特質。',
    [LifePassportKey.圓圈多]: '',
    [LifePassportKey.圓圈少]: '',
    [LifePassportKey.圓圈]:
      '你不吝嗇給別人機會，很為家人、朋友奉獻，懂得照顧別人是非常的貼心的人，但也需要別人真誠公平的對待。',
    [LifePassportKey.無數字]:
      '比較容易覺得好像付出的跟回報不成正比，因為在這個部分特質比較隱藏，所以會覺得好像自己努力了很多但都沒有相應的回報，久而久之就覺得做的很累無力。',
  },
  7: {
    [LifePassportKey.方形三角圓圈]:
      '你的貴人運強會有很多人願意幫助你，要好好把握人家幫助你的機會，要記得你也有可能是別人的貴人。你很喜歡探究真理真相的人，不過有時候會有過度專研和鑽牛角尖的情況出現，那你也有可能會有質疑個性出現，質疑自己的能力、質疑別人，反其道而行都是有可能的， 質疑雖然不是缺點但是可以把質疑加上求證的態度，更加了解後可以把質疑轉換成有根據的，讓事情更理智更完美，貴人運雖強但也有可能會容易遇到小人，這個部分要多加小心。你一生的課題要學會接受事實，遇到挫折不能像鴕鳥一樣把頭埋進沙裡，不要等機會從天而降，要積極主動。',
    [LifePassportKey.方形三角]:
      '你很喜歡探究真理真相的人，不過有時候會有過度專研和鑽牛角尖的情況出現，那你也有可能會有質疑個性出現，質疑自己的能力、質疑別人，反其道而行都是有可能的， 質疑雖然不是缺點但是可以把質疑加上求證的態度，更加了解後可以把質疑轉換成有根據的，讓事情更理智更完美，貴人運雖強但也有可能會容易遇到小人，這個部分要多加小心。你一生的課題要學會接受事實，遇到挫折不能像鴕鳥一樣把頭埋進沙裡，不要等機會從天而降，要積極主動。',
    [LifePassportKey.方形圓圈]:
      '你的貴人運強會有很多人願意幫助你，要好好把握人家幫助你的機會，要記得你也有可能是別人的貴人。你一生的課題要學會接受事實，遇到挫折不能像鴕鳥一樣把頭埋進沙裡，不要等機會從天而降，要積極主動。',
    [LifePassportKey.方形]:
      '你會有許多貴人相助，可以發現在有困難的時候都會有人來幫助你，要記得你也有可能是別人的貴人，要學會善緣相續，你的貴人運會源源不斷！貴人運好自然運氣就跟著好，你也是一個很喜歡探究真理真相的人，會喜歡理性分析、研究、邏輯、推理方面的事情，非常適合往專業領域去發展的，你會希望自己能在專業領域裡做到最好，具有研究精神！你一生的課題要學會接受事實，遇到挫折不能像鴕鳥一樣把頭埋進沙裡，不要等機會從天而降，要積極主動。',
    [LifePassportKey.三角]:
      '你的貴人運強會有很多人願意幫助你，要好好把握人家幫助你的機會，要記得你也有可能是別人的貴人。你很喜歡探究真理真相的人，不過有時候會有過度專研和鑽牛角尖的情況出現，那你也有可能會有質疑個性出現，質疑自己的能力、質疑別人，反其道而行都是有可能的， 質疑雖然不是缺點但是可以把質疑加上求證的態度，更加了解後可以把質疑轉換成有根據的，讓事情更理智更完美，貴人運雖強但也有可能會容易遇到小人，這個部分要多加小心。',
    [LifePassportKey.圓圈多]: '',
    [LifePassportKey.圓圈少]: '',
    [LifePassportKey.圓圈]:
      '你的貴人運強會有很多人願意幫助你，要好好把握人家幫助你的機會，要記得你也有可能是別人的貴人，幫助別人的這份心意也會回饋到你自己身上，以前你幫助過的人有天他也會在你需要的時候再一次出現。要學會善緣相續，你的貴人運會源源不斷!貴人運好自然運氣就跟著好。',
    [LifePassportKey.無數字]:
      '貴人運的部分是稍微隱藏的，不是沒有貴人而是都靠自己苦幹實幹，比較累也比較辛苦，貴人運有點像老天爺送的禮物，有的人多有的人少，只能靠一些幸運小物來加持，像是護身符的概念，不管在任何狀態下都希望有人幫助你更事半功倍。',
  },
  8: {
    [LifePassportKey.方形三角圓圈]:
      '你是一個很有上進心、學習能力很好，努力達成目標的人，容易出現太大意或是警覺心過頭，自尊心、控制慾、掌控慾也會更強，容易走向自大、霸道，非常需要他人的尊重。你一生的課題，因為是屬於比較有商業、生意頭腦、實際的個性，容易去分析利與弊，在交友上可以少一點利與弊的氛圍，比較不會讓人有勢力的感覺，不過沒有的話就沒有關係不用太過在意。記得誠實面對自己的成功與失敗，把失敗當成走向成功的方法之一，這中間選擇不論是失敗了或是選錯了，只要這中間有學習到以往沒有的觀念、經驗，那這就是你最棒的成功，因為你每一天都比自己的前一天進步了也更加優秀了。',
    [LifePassportKey.方形三角]:
      '容易出現太大意或是警覺心過頭，自尊心、控制慾、掌控慾也會更強，容易走向自大、霸道，非常需要他人的尊重。你一生的課題，因為是屬於比較有商業、生意頭腦、實際的個性，容易去分析利與弊，在交友上可以少一點利與弊的氛圍，比較不會讓人有勢力的感覺，不過沒有的話就沒有關係不用太過在意記得誠實面對自己的成功與失敗，把失敗當成走向成功的方法之一，這中間選擇不論是失敗了或是選錯了，只要這中間有學習到以往沒有的觀念、經驗，那這就是你最棒的成功，因為你每一天都比自己的前一天進步了也更加優秀了。',
    [LifePassportKey.方形圓圈]:
      '你是一個很有上進心、學習能力很好，很有商業頭腦，努力達成目標的人，通常行動力很強，閒不下來，有點像工作狂的感覺，也會出現事情都想要去掌控的勞碌命特質，不過不會自覺勞碌命，反而會有種樂在其中的感覺。你一生的課題，因為是屬於比較有商業、生意頭腦、實際的個性，容易去分析利與弊，在交友上可以少一點利與弊的氛圍，比較不會讓人有勢力的感覺，不過沒有的話就沒有關係不用太過在意。記得誠實面對自己的成功與失敗，把失敗當成走向成功的方法之一，這中間選擇不論是失敗了或是選錯了，只要這中間有學習到以往沒有的觀念、經驗，那這就是你最棒的成功，因為你每一天都比自己的前一天進步了也更加優秀了。',
    [LifePassportKey.方形]:
      '你屬於比較有商業、生意頭腦、實際的個性，容易去分析利與弊，在交友上可以少一點利與弊的氛圍，比較不會讓人有勢力的感覺，不過沒有的話就沒有關係不用太過在意。記得誠實面對自己的成功與失敗，把失敗當成走向成功的方法之一，這中間選擇不論是失敗了或是選錯了，只要這中間有學習到以往沒有的觀念、經驗，那這就是你最棒的成功，因為你每一天都比自己的前一天進步了也更加優秀了。',
    [LifePassportKey.三角]:
      '你是一個很有上進心、學習能力很好，很有商業頭腦，努力達成目標的人，通常行動力很強，閒不下來，有點像工作狂的感覺，也會出現事情都想要去掌控的勞碌命特質，不過不會自覺勞碌命，反而會有種樂在其中的感覺。容易出現太大意或是警覺心過頭，自尊心、控制慾、掌控慾也會更強，容易走向自大、霸道，非常需要他人的尊重。',
    [LifePassportKey.圓圈多]:
      '你的自尊心、控制慾、掌控慾也會更強，容易走向自大、霸道，非常需要他人的尊重。',
    [LifePassportKey.圓圈少]:
      '你是一個很有上進心、學習能力很好，很有商業頭腦，努力達成目標的人，通常行動力很強，閒不下來，有點像工作狂的感覺，也會出現事情都想要去掌控的勞碌命特質，不過不會自覺勞碌命，反而會有種樂在其中的感覺。',
    [LifePassportKey.圓圈]: '',
    [LifePassportKey.無數字]:
      '你比較沒有慾望和野心，不容易被成就感等思想壓迫，隨遇而安，沒有不好但有時候就是需要那份爭取的心，機會才能場握在自己手裡那因為不會特別眷戀權力所以在公事上也比較不會要求下屬，容易出現無法掌控局面的情況和缺乏震攝力。',
  },
  9: {
    [LifePassportKey.方形三角圓圈]:
      '你很熱心很有愛心的人，會發現和宗教很有緣，不一定是哪個宗教，也是一個想很多的人，比較喜歡做夢有很多的夢想，但不能光想還是要去做，不然會原地踏步對你沒有好處，會對朋友、家人奉獻過頭，雞婆，甚麼事情都想要參一腳、都想幫忙，不分好壞無止境的奉獻，這個部份希望調整到更好，願意奉獻是好的但要看清楚事情再去做奉獻的事，有這樣特質的你多做一些善舉對你的事業會很有幫助，也會成為你成功的跳台。你一生的課題在奉獻，奉獻這件事情在人生中是不可或缺的一環，發自內心的提供幫助，你會收穫良多，以及要調整對完美主義的追求，不過度期待別人、要求別人。',
    [LifePassportKey.方形三角]:
      '容易會對朋友、家人奉獻過頭，雞婆，甚麼事情都想要參一腳、都想幫忙，不分好壞無止境的奉獻，這個部份希望調整到更好，願意奉獻是好事但要看清楚再去做奉獻的事。你一生的課題也在奉獻，奉獻這件事情在人生中是不可或缺的一環，發自內心的提供幫助，你會收穫良多，以及要調整對完美主義的追求，不過度期待別人、要求別人。',
    [LifePassportKey.方形圓圈]:
      '你是很熱心很有愛心的人，會發現和宗教很有緣，不一定是哪個宗教，也是一個想很多的人，比較喜歡做夢有很多的夢想，但不能光想還是要去做，建議你在有什麼想法時可以先寫下來，有一天這些想法也會成為不錯的idea，會有想賺大錢的心，這個想法人人都有不用擔心，但要記得有捨就有得，有這樣特質的你多做一些善舉對你的事業會很有幫助，也會成為你成功的跳台。你一生的課題在奉獻，奉獻這件事情在人生中是不可或缺的一環，發自內心的提供幫助，你會收穫良多，以及要調整對完美主義的追求，不過度期待別人、要求別人。',
    [LifePassportKey.方形]:
      '你是一個很有愛心很熱心的人，服務特質明顯很喜歡幫助別人，你一生的課題在奉獻，奉獻這件事情在人生中是不可或缺的一環，發自內心的提供幫助，你會收穫良多，以及要調整對完美主義的追求，不過度期待別人、要求別人。',
    [LifePassportKey.三角]:
      '你很熱心很有愛心的人，會發現和宗教很有緣，不一定是哪個宗教，也是一個想很多的人，比較喜歡做夢有很多的夢想，但不能光想還是要去做，不然會原地踏步對你沒有好處，會對朋友、家人奉獻過頭，雞婆，甚麼事情都想要參一腳、都想幫忙，不分好壞無止境的奉獻，這個部份希望調整到更好，願意奉獻是好的但要看清楚事情再去做奉獻的事，有這樣特質的你多做一些善舉對你的事業會很有幫助，也會成為你成功的跳台。',
    [LifePassportKey.圓圈多]:
      '你是很熱心很有愛心的人，會發現和宗教很有緣，不一定是哪個宗教，也是一個想很多的人，比較喜歡做夢有很多的夢想，但不能光想還是要去做，也會出現兩種局面，一種是奉獻、一種是懶惰，容易出現叛逆心重的局面，要記得有捨就有得，多做一些善舉對你的事業會很有幫助，也會成為你成功的跳台。',
    [LifePassportKey.圓圈少]:
      '你是很熱心很有愛心的人，會發現和宗教很有緣，不一定是哪個宗教，也是一個想很多的人，比較喜歡做夢有很多的夢想，但不能光想還是要去做，建議你在有什麼想法時可以先寫下來，有一天這些想法也會成為不錯的idea，會有想賺大錢的心，這個想法人人都有不用擔心，但要記得有捨就有得，有這樣特質的你多做一些善舉對你的事業會很有幫助，也會成為你成功的跳台。',
    [LifePassportKey.圓圈]: '',
    [LifePassportKey.無數字]:
      '喜歡專注在自己身上，對自己以外的事情比較不感興趣，更喜歡關注自己碰上的挑戰和疑問。',
  },
};
